In [3]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
 	 'Age': [25, 30, 35],
	 'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df)
df['Expanding_Mean_Salary'] = df['Salary'].expanding().mean()
print(df)
df['Exp_Mean_Salary'] = df['Salary'].expanding(2).mean()
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
      Name  Age  Salary  Expanding_Mean_Salary
0    Alice   25   50000           50000.000000
1      Bob   30   60000           55000.000000
2  Charlie   35   75000           61666.666667
      Name  Age  Salary  Expanding_Mean_Salary  Exp_Mean_Salary
0    Alice   25   50000           50000.000000              NaN
1      Bob   30   60000           55000.000000     55000.000000
2  Charlie   35   75000           61666.666667     61666.666667

In [4]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Salary': [50000, 60000, 75000]
}
df = pd.DataFrame(data)
print(df)
# Calculate exponentially weighted moving average of Salary
# The 'span' parameter controls the decay; a smaller span gives more weight to recent observations
df['EWM_Salary'] = df['Salary'].ewm(span=2).mean()
print("\nDataFrame with Exponentially Weighted Moving Average Salary:")
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000

DataFrame with Exponentially Weighted Moving Average Salary:
      Name  Age  Salary    EWM_Salary
0    Alice   25   50000  50000.000000
1      Bob   30   60000  57500.000000
2  Charlie   35   75000  69615.384615

In [7]:
import pandas as pd
df1 = pd.DataFrame({
    'EmployeeID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department': ['HR', 'Finance', 'IT', 'Marketing']
})
print(df1)
df2 = pd.DataFrame({
    'EmployeeID': [102, 103, 104, 105],
    'Salary': [60000, 75000, 58000, 52000],
    'JoiningYear': [2015, 2016, 2017, 2018]
})
print(df2)
# Merge DataFrames on 'EmployeeID' with inner join (default)
result_inner = pd.merge(df1, df2, on='EmployeeID')
print("Inner Join (Only matching EmployeeID):")
print(result_inner)

   EmployeeID     Name Department
0         101    Alice         HR
1         102      Bob    Finance
2         103  Charlie         IT
3         104    David  Marketing
   EmployeeID  Salary  JoiningYear
0         102   60000         2015
1         103   75000         2016
2         104   58000         2017
3         105   52000         2018
Inner Join (Only matching EmployeeID):
   EmployeeID     Name Department  Salary  JoiningYear
0         102      Bob    Finance   60000         2015
1         103  Charlie         IT   75000         2016
2         104    David  Marketing   58000         2017

In [11]:
import pandas as pd
df1 = pd.DataFrame({
    'EmployeeID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department': ['HR', 'Finance', 'IT', 'Marketing']
})
print(df1)
df2 = pd.DataFrame({
    'EmployeeID': [102, 103, 104, 105],
    'Salary': [60000, 75000, 58000, 52000],
    'JoiningYear': [2015, 2016, 2017, 2018]
})
print(df2)
# Merge DataFrames on 'EmployeeID' with inner join (default)
result_inner = pd.merge(df1, df2, on='EmployeeID')
print("Inner Join (Only matching EmployeeID):")
print(result_inner)
# Merge DataFrames on 'EmployeeID' with left join 
result_left = pd.merge(df1, df2, on='EmployeeID',how='left')
print("left Join (Only matching EmployeeID):")
print(result_left)
# Merge DataFrames on 'EmployeeID' with right join 
result_right = pd.merge(df1, df2, on='EmployeeID',how='right')
print("right Join (Only matching EmployeeID):")
print(result_right)

   EmployeeID     Name Department
0         101    Alice         HR
1         102      Bob    Finance
2         103  Charlie         IT
3         104    David  Marketing
   EmployeeID  Salary  JoiningYear
0         102   60000         2015
1         103   75000         2016
2         104   58000         2017
3         105   52000         2018
Inner Join (Only matching EmployeeID):
   EmployeeID     Name Department  Salary  JoiningYear
0         102      Bob    Finance   60000         2015
1         103  Charlie         IT   75000         2016
2         104    David  Marketing   58000         2017
left Join (Only matching EmployeeID):
   EmployeeID     Name Department   Salary  JoiningYear
0         101    Alice         HR      NaN          NaN
1         102      Bob    Finance  60000.0       2015.0
2         103  Charlie         IT  75000.0       2016.0
3         104    David  Marketing  58000.0       2017.0
right Join (Only matching EmployeeID):
   EmployeeID     Name Department  Salary  JoiningYear
0         102      Bob    Finance   60000         2015
1         103  Charlie         IT   75000         2016
2         104    David  Marketing   58000         2017
3         105      NaN        NaN   52000         2018

In [12]:
# Merge DataFrames on 'EmployeeID' with outer join
result_outer = pd.merge(df1, df2, on='EmployeeID', how='outer')
print("\nOuter Join (All from both dfs):")
print(result_outer)

Outer Join (All from both dfs):
   EmployeeID     Name Department   Salary  JoiningYear
0         101    Alice         HR      NaN          NaN
1         102      Bob    Finance  60000.0       2015.0
2         103  Charlie         IT  75000.0       2016.0
3         104    David  Marketing  58000.0       2017.0
4         105      NaN        NaN  52000.0       2018.0

In [18]:
import pandas as pd
df1 = pd.DataFrame({
    	'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    	'Department': ['HR', 'Finance', 'IT', 'Marketing']
	}, index=[101, 102, 103, 104])
print('\n',df1)
df2 = pd.DataFrame({
    	'Salary': [60000, 75000, 58000, 52000],
    	'JoiningYear': [2015, 2016, 2017, 2018]
	}, index=[102, 103, 104, 105])
print('\n',df2)

# Join df2 to df1 on their indices with inner join
result_inner = df1.join(df2, how='inner')
print("\nInner Join (Only matching indices):")
print(result_inner)

         Name Department
101    Alice         HR
102      Bob    Finance
103  Charlie         IT
104    David  Marketing

      Salary  JoiningYear
102   60000         2015
103   75000         2016
104   58000         2017
105   52000         2018

Inner Join (Only matching indices):
        Name Department  Salary  JoiningYear
102      Bob    Finance   60000         2015
103  Charlie         IT   75000         2016
104    David  Marketing   58000         2017

In [19]:
# Join df2 to df1 on their indices with left join
result_left = df1.join(df2, how='left')
print("\nLeft Join (All indices from df1 with matching from df2):")
print(result_left)
result_left = df2.join(df1, how='left')
print("\nLeft Join (All indices from df2 with matching from df1):")
print(result_left)
# Join df2 to df1 on their indices with right join
result_right = df1.join(df2, how='right')
print("\nright Join (All indices from df2 with matching from df1):")
print(result_right)
# Join df2 to df1 on their indices with outer join
result_outer = df1.join(df2, how='outer')
print("\nOuter Join (All indices from both dfs):")
print(result_outer)

Left Join (All indices from df1 with matching from df2):
        Name Department   Salary  JoiningYear
101    Alice         HR      NaN          NaN
102      Bob    Finance  60000.0       2015.0
103  Charlie         IT  75000.0       2016.0
104    David  Marketing  58000.0       2017.0

Left Join (All indices from df2 with matching from df1):
     Salary  JoiningYear     Name Department
102   60000         2015      Bob    Finance
103   75000         2016  Charlie         IT
104   58000         2017    David  Marketing
105   52000         2018      NaN        NaN

right Join (All indices from df2 with matching from df1):
        Name Department  Salary  JoiningYear
102      Bob    Finance   60000         2015
103  Charlie         IT   75000         2016
104    David  Marketing   58000         2017
105      NaN        NaN   52000         2018

Outer Join (All indices from both dfs):
        Name Department   Salary  JoiningYear
101    Alice         HR      NaN          NaN
102      Bob    Finance  60000.0       2015.0
103  Charlie         IT  75000.0       2016.0
104    David  Marketing  58000.0       2017.0
105      NaN        NaN  52000.0       2018.0

In [5]:
import pandas as pd
df1 = pd.DataFrame({
    	'EmployeeID': [101, 102, 103], 
	'Name': ['Alice', 'Bob', 'Charlie']   })
df2 = pd.DataFrame({
	    'EmployeeID': [104, 105],
	    'Name': ['David', 'Eva']
	})
df3 = pd.DataFrame({
	    'EmployeeID': [106, 107],
	    'Name': ['Frank', 'Grace']
	})
print(df1)
print(df2)
print(df3)
# Concatenate DataFrames along rows (axis=0)
result_rows = pd.concat([df1, df2, df3], axis=0)
print("Concatenated DataFrames along rows:")
print(result_rows)
df4 = pd.DataFrame({
	'Department': ['HR', 'Finance', 'IT', 	'Marketing', 'Sales', 'Support']
	})
result_columns = pd.concat( [result_rows.reset_index(drop=True), df4], axis=1)
print("\nConcatenated DataFrames along columns:")
print(result_columns)

   EmployeeID     Name
0         101    Alice
1         102      Bob
2         103  Charlie
   EmployeeID   Name
0         104  David
1         105    Eva
   EmployeeID   Name
0         106  Frank
1         107  Grace
Concatenated DataFrames along rows:
   EmployeeID     Name
0         101    Alice
1         102      Bob
2         103  Charlie
0         104    David
1         105      Eva
0         106    Frank
1         107    Grace

Concatenated DataFrames along columns:
   EmployeeID     Name Department
0         101    Alice         HR
1         102      Bob    Finance
2         103  Charlie         IT
3         104    David  Marketing
4         105      Eva      Sales
5         106    Frank    Support
6         107    Grace        NaN

In [ ]:
df4 = pd.DataFrame({
	'Department': ['HR', 'Finance', 'IT', 	'Marketing', 'Sales', 'Support']
	})
result_columns = pd.concat( [result_rows.reset_index(drop=True), df4], axis=1)
print("\nConcatenated DataFrames along columns:")
print(result_columns)

In [13]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
 	 'Age': [25, 30, 35],
	 'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)

# Use the stack() function
stacked_df = df.set_index('Name').stack()
# Rename the columns for clarity
stacked_df.columns = ['Name', 'Attribute', 'Value']
print(stacked_df)
print("\nresetindex\n",stacked_df.reset_index())

Name
Alice    Age          25
         Salary    50000
Bob      Age          30
         Salary    60000
Charlie  Age          35
         Salary    75000
dtype: int64

resetindex
       Name level_1      0
0    Alice     Age     25
1    Alice  Salary  50000
2      Bob     Age     30
3      Bob  Salary  60000
4  Charlie     Age     35
5  Charlie  Salary  75000

In [7]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df)
# Stack the DataFrame
stacked_df = df.set_index('Name').stack().reset_index()
stacked_df.columns = ['Name', 'Attribute', 'Value']
print(stacked_df)
# unstack() to pivot back to wide format
unstacked_df = stacked_df.set_index(['Name', 'Attribute']).unstack()
print('\n',unstacked_df)
# Reset index to make it a regular DataFrame
unstacked_df.columns = unstacked_df.columns.droplevel(1)  
# Remove the top level of the column MultiIndex
unstacked_df.reset_index(inplace=True)
print('\n',unstacked_df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
      Name Attribute  Value
0    Alice       Age     25
1    Alice    Salary  50000
2      Bob       Age     30
3      Bob    Salary  60000
4  Charlie       Age     35
5  Charlie    Salary  75000

           Value
Attribute   Age Salary
Name
Alice        25  50000
Bob          30  60000
Charlie      35  75000

       Name  Value  Value
0    Alice     25  50000
1      Bob     30  60000
2  Charlie     35  75000

In [10]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
 	 'Age': [25, 30, 35],
	 'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000

In [11]:
df1=df.transpose(copy=True)
df1

            0      1        2
Name    Alice    Bob  Charlie
Age        25     30       35
Salary  50000  60000    75000

In [12]:
df1.T

      Name Age Salary
0    Alice  25  50000
1      Bob  30  60000
2  Charlie  35  75000

In [16]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],  
    'Age': [25, 30, 35],
    'Hobbies': [['Reading', 'Hiking'], ['Cooking'], ['Gaming', 'Traveling']]
}
df = pd.DataFrame(data)
print(df)
exploded_df = df.explode('Hobbies')
print('\n',exploded_df)
exploded_df = df.explode('Hobbies',ignore_index=True)
print('\n',exploded_df)

      Name  Age              Hobbies
0    Alice   25    [Reading, Hiking]
1      Bob   30            [Cooking]
2  Charlie   35  [Gaming, Traveling]

       Name  Age    Hobbies
0    Alice   25    Reading
0    Alice   25     Hiking
1      Bob   30    Cooking
2  Charlie   35     Gaming
2  Charlie   35  Traveling

       Name  Age    Hobbies
0    Alice   25    Reading
1    Alice   25     Hiking
2      Bob   30    Cooking
3  Charlie   35     Gaming
4  Charlie   35  Traveling